#
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install.sh)"
# curl https://raw.githubusercontent.com/ozhankaraman/dotfiles/master/.Brewfile -O $HOME/Downloads/.Brewfile
#
# brew bundle install --file=$HOME/.Brewfile
# brew upgrade --cask utm

# System tools
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'wget'
brew 'awsume'
brew 'aws-sso-util'
brew 'watch'
brew 'ansible'
brew 'pre-commit'
brew 'k3d'
# brew 'duti'

brew 'vim'
brew 'jq'
brew 'yq'
brew 'telnet'
brew 'tmux'
brew 'fzf'
brew 'powerlevel10k'
brew 'fping'
brew 'speedtest-cli'
brew 'argocd'
brew 'vault'
brew 'gnupg'
brew 'gron'
brew 'htop'
brew 'MisterTea/et/et'

# Containers
brew 'kubernetes-cli'
brew 'krew'
brew 'kind'
brew 'kustomize'
brew 'cfssl'
brew 'helm'
brew 'helmfile'
brew 'k9s'
brew 'kubebuilder'
brew 'cilium-cli'
brew 'talosctl'
brew 'clusterctl'
brew 'holos-run/tap/holos'
brew 'kubelogin'
brew 'gitleaks'

cask 'easy-move+resize'
cask 'alacritty'
cask 'vnc-viewer'
cask 'keepassxc'
cask 'vlc'
# cask 'viscosity'
# cask 'multipass'
cask 'font-sf-mono'
cask 'tsh'
cask 'session-manager-plugin'
cask 'open-in-code'
cask 'spotify'
# cask 'google-chrome'
# cask 'firefox'
cask 'balenaetcher'
cask 'utm'
cask 'google-cloud-sdk'
cask 'raspberry-pi-imager'
