#
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install.sh)"
# curl https://raw.githubusercontent.com/ozhankaraman/dotfiles/master/.Brewfile -O $HOME/Downloads/.Brewfile
# brew bundle install --file=$HOME/Downloads/.Brewfile

# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'ldez/tap'
tap 'homebrew/cask-fonts'
tap 'starkandwayne/cf'

# System tools
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
# brew 'parallel'
# brew 'screen'
brew 'ncurses'
brew 'pv'
# unrar is removed because of licensing problems for HomeBrew
# brew 'unrar'
cask 'the-unarchiver'
cask 'raspberry-pi-imager'
brew 'shfmt'
brew 'MisterTea/et'
brew 'httpie'
brew 'dog'
# cask 'easy-move-plus-resize'

# Development & Power Tools
cask 'iterm2'
cask 'alacritty'
cask 'visual-studio-code'
brew 'bash'
# brew 'bash-completion'
brew 'zsh'
# brew 'zsh-syntax-highlighting'
# brew 'zsh-autosuggestions'
# brew 'zsh-completions'
brew 'ack'
brew 'ccat'
brew 'icdiff'
brew 'diff-so-fancy'
brew 'git'
# brew 'interactive-rebase-tool'
brew 'fzf'
brew 'jq'
brew 'yq'
brew 'python@3.9'
brew 'go'
# brew 'pipx'
brew 'openssl'
brew 'openssh'
brew 'iperf'
# brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tree'
brew 'wget'
cask 'google-cloud-sdk'
brew 'watch'
brew 'fd'
brew 'ncdu'
brew 'wdiff'
brew 'entr'
brew 'tldr'
brew 'shellcheck'
brew 'telnet'
brew 'mitmproxy'
brew 'fortio'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'fping'
brew 'hey'
brew 'speedtest-cli'
brew 'vim'
brew 'tmux'
brew 'jless'
brew 'fx'
brew 'gh'
# brew 'terraform@0.14'
brew 'terraform'
brew 'starkandwayne/cf/safe'
# brew 'fluxcd/tap/flux'
cask 'flux'
brew 'argocd'
brew 'argo'
brew 'argoproj/tap/kubectl-argo-rollouts'
brew 'frigus02/tap/kyml'
brew 'kafkacat'
brew 'gnupg'
brew 'istioctl'
brew 'kubeseal'
brew 'vault'
brew 'vcluster'

# Containers
brew 'kubernetes-cli'
brew 'kubectx'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
brew 'calicoctl'
brew 'helm'
brew 'helmfile'
# brew 'k9s'
brew 'tektoncd-cli'
# brew 'kind'
# brew 'k3sup'
brew 'clusterctl'
brew 'kubeseal'

# Fun tools
brew 'asciinema'
brew 'lolcat'

# Desktop Software
cask 'clipy'
cask 'zoom'
cask 'slack'
cask 'microsoft-teams'
# cask 'rectangle'
cask 'spotify'
# cask 'dropbox'
cask 'google-drive'
cask 'google-chrome'
cask 'firefox'
cask 'open-in-code'
cask 'balenaetcher'
cask 'vnc-viewer'
cask 'font-hack-nerd-font'
cask 'keepassxc'
cask 'vlc'
cask 'viscosity'
cask 'sublime-text'

# iMac Tools who needs high CPU/Mem Consumption
# cask 'docker' # docker for desktop
# brew 'docker-machine-driver-hyperkit'
# cask 'multipass'
# brew 'virtualbox'
# brew 'minikube'
